// 17강. 반복문(for문) - 연습문제
#include <stdio.h>

int main(void){
    //////////////////////////////////////////////
    // Q1. 구구단 4단
    int dan = 4;
    printf("== Q1. 구구단 %d단 ==\n", dan);

    for(int i=1; i<10; i++){
        printf("%d X %d = %d\n", dan, i, dan*i);
    }

    printf("====================\n");
    //////////////////////////////////////////////
    
    //////////////////////////////////////////////
    //Q2. 400 ~ -200까지 출력
    printf("\n== Q2. 400에서 -200까지 출력 ==\n");

    for(int i=400; i>=-200; i--){
        printf("%d\n",i);
    }
    
    printf("===============================\n");

}